# 1) Определение количества различных подстрок с использованием хеш-функции. Пусть на вход функции дана строка.
# Требуется вернуть количество различных подстрок в этой строке.
# Примечание: в сумму не включаем пустую строку и строку целиком.
# Пример работы функции:
#
# func("papa")
# 6
# func("sova")
# 9

import hashlib

str = input('Введите строку: ')

sum_ = set()

for i in range(len(str)):
    for j in range(len(str), i, -1):
        hash_str = hashlib.sha1(str[i:j].encode('utf-8')).hexdigest()
        sum_.add(hash_str)

print(f'{len(sum_) -1} различных подстрок в строке {str}')



